# Dotfiles Brewfile
# Install all required packages with: brew bundle

# Taps
tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Core window management and productivity tools
cask "nikitabobko/tap/aerospace"    # Tiling window manager
brew "FelixKratz/formulae/sketchybar"  # Status bar
cask "hammerspoon"                  # Automation and scripting
cask "karabiner-elements"          # Keyboard customization
cask "raycast"                     # Launcher and productivity tool
cask "obsidian"                    # Note-taking application

# Development tools and terminals
cask "warp"                        # Modern terminal with AI features
cask "visual-studio-code"          # Code editor
cask "postman"                     # API development and testing
brew "node@20"                     # Node.js version 20
brew "gh"                          # GitHub CLI
brew "git"                         # Version control
# Claude AI CLI installed via npm in bootstrap.sh
brew "codex"                       # Codex CLI tool
cask "orbstack"                    # Fast, light, simple Docker Desktop alternative

# Communication and productivity
cask "slack"                       # Team communication
cask "telegram"                    # Messaging app
cask "mailspring"                  # Email client
cask "todoist-app"                 # Task management
cask "notion"                      # All-in-one workspace
cask "discord"                     # Gaming and community chat

# Security and utilities
cask "tresorit"                    # Secure cloud storage
cask "pritunl"                     # VPN client

# Entertainment and media
cask "spotify"                     # Music streaming

# Calendar and scheduling
brew "khal"                        # Calendar application

# Fonts (required for sketchybar and terminal apps)
cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono with Nerd Font icons

# Web browsers
cask "google-chrome"               # Chrome browser
cask "firefox"                     # Firefox browser