[
  "obsidian-kanban",
  "calendar",
  "table-editor-obsidian",
  "sliding-panes-obsidian",
  "templater-obsidian",
  "obsidian-mind-map",
  "obsidian-outliner",
  "nldates-obsidian",
  "note-refactor-obsidian",
  "better-word-count",
  "tag-wrangler",
  "review-obsidian",
  "periodic-notes",
  "emoji-shortcodes",
  "find-unlinked-files",
  "recent-files-obsidian",
  "obsidian-tasks-plugin",
  "obsidian-reading-time",
  "obsidian-vault-statistics-plugin",
  "obsidian-linter",
  "smart-random-note",
  "auto-note-mover",
  "obsidian-paste-image-rename",
  "homepage",
  "obsidian-banners",
  "obsidian-doubleshift",
  "various-complements",
  "obsidian42-text-transporter",
  "simple-embeds",
  "oz-image-plugin",
  "obsidian-emotion-picker",
  "obsidian-minimal-settings",
  "obsidian-style-settings",
  "dataview",
  "ledger-obsidian",
  "actions-uri",
  "make-md",
  "terminal"
]